/*
**						MSharpena Filter AVX2 and CUDA ver 0.0.2
**
**	The MIT License
**
**	Copyright (c) 2012-2014 miya <@sundola8x>
**
**	Permission is hereby granted, free of charge, to any person obtaining a copy of
**	this software and associated documentation files (the "Software"), to deal in
**	the Software without restriction, including without limitation the rights to
**	use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies
**	of the Software, and to permit persons to whom the Software is furnished to do
**	so, subject to the following conditions:
**
**	The above copyright notice and this permission notice shall be included in all
**	copies or substantial portions of the Software.
**
**	THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
**	IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
**	FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
**	AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
**	LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
**	OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
**	SOFTWARE.
**
**	Thanks to the original plugin author: https://github.com/tp7/msharpen
*/
#include "stdafx.h"
#include "msharpenb.h"
#include "msharpenb_cpu.h"

#define MSHARPEN_TRUE		0xffff
#define MSHARPEN_FALSE		0
#define BLUR_CENTER_MUL		22444
#define BLUR_ANOTHER_MUL	21546

#define MSHAPERN_COPY_WORK_INSRW(idx) \
vpinsrw		xmm0, xmm0, XMMWORD PTR[esi + edx + 0], idx;\
vpinsrw		xmm1, xmm1, XMMWORD PTR[esi + edx + 2], idx;\
vpinsrw		xmm2, xmm2, XMMWORD PTR[esi + edx + 4], idx; 

typedef struct tagMSHARPEN_AVX2_CORE_PARAM
{
	// 共有メモリの設定 
	int thread_step;				// 0 - 4
	// - ブレーンコピー用
	short	*work;					// 4 - 8
	// - ブラー作業用
	short	*wblurx;				// 8 - 12
	// - ブラー作業用2
	short	*wblury;				// 12 - 16
	// - マスク作業用	
	unsigned short   *wmask;					// 16 - 20
	//2014.09.01 ↓SIMD向けに実相
	// - ブラー作業用横ピッチ
	int		wpitch;					// 20 - 24
	// - プレーン選択用
	int		zpitch;					// 24 - 28

	int		y__plane;				// 28 - 32
	int		cb_plane;				// 32 - 36
	int		cr_plane;				// 36 - 40

	// -- filler
	int		hoge[6];				// 40 - 64

	// -- mm
	short	threshold_mm[16];
	short	true_bit_pattern_mm[16];
	short	blur_center_mul_mm[16];
	short	blur_another_mul_mm[16];
	short	strength_mm[16];
	short	invstrength_mm[16];
	short	detect_max_mm[16];
	short	detect_min_mm[16];

	//2014.09.01 ↑SIMD向けに実相

} MSHARPEN_AVX2_CORE_PARAM, *LPMSHARPEN_AVX2_CORE_PARAM;

#pragma region avx2 filter

//---------------------------------------------------------------------
//		インライン関数
//---------------------------------------------------------------------
// 閾値チェック
inline BOOL is_threshold_avx2_over(_In_ const short *yca, _In_ const short *ycb, const LPMSHARPEN_AVX2_CORE_PARAM core_param) {
	if (abs(yca[core_param->y__plane] - ycb[core_param->y__plane]) >= param.threshold) return TRUE;
	if (abs(yca[core_param->cb_plane] - ycb[core_param->cb_plane]) >= param.threshold) return TRUE;
	if (abs(yca[core_param->cr_plane] - ycb[core_param->cr_plane]) >= param.threshold) return TRUE;
